Repository: glazebyte/smart_plant
Catalog: lib/l10n/app_*.arb
Languages: id

# appTitle
source: Smart Plant Monitor
id: Monitor Tanaman Pintar

source: Dashboard
id: Beranda

source: Control
id: Kontrol

source: Schedule
id: Jadwal

source: Logs
id: Riwayat

source: Settings
id: Pengaturan

source: Soil Moisture
id: Kelembaban Tanah

source: Humidity
id: Kelembaban Udara

source: Temperature
id: Suhu

source: Current Readings
id: Pembacaan Saat Ini

# noSensorData
source: No sensor data available
id: Tidak ada data sensor

# waitingForData
source: Waiting for data from your smart plant...
id: Menunggu data dari tanaman pintar Anda...

# connectToViewData
source: Connect to your smart plant to view data
id: Hubungkan ke tanaman pintar Anda untuk melihat data

source: Last Update
id: Pembaruan Terakhir

source: Just now
id: Baru saja

# minutesAgo
source: {minutes}m ago
id: {minutes} menit lalu

# hoursAgo
source: {hours}h ago
id: {hours} jam lalu

source: Device Connection
id: Koneksi Perangkat

source: Disconnected
id: Terputus

source: Scanning...
id: Memindai...

source: Connecting...
id: Menghubungkan...

source: Connected
id: Terhubung

source: Connection Error
id: Kesalahan Koneksi

source: No devices found
id: Tidak ada perangkat ditemukan

# devicePairingInstructions
source: Make sure your smart plant device is powered on and in pairing mode
id: Pastikan perangkat tanaman pintar Anda menyala dan dalam mode pairing

source: Scan Again
id: Pindai Lagi

source: Scan for Devices
id: Pindai Perangkat

# scanningForDevices
source: Scanning for smart plant devices...
id: Memindai perangkat tanaman pintar...

source: Disconnect
id: Putuskan

# connectedTo
source: Connected to {deviceName}
id: Terhubung ke {deviceName}

# failedToConnect
source: Failed to connect: {error}
id: Gagal menghubungkan: {error}

source: Manual Control
id: Kontrol Manual

source: Device Not Connected
id: Perangkat Tidak Terhubung

# connectToUseControls
source: Connect to your smart plant device to use manual controls
id: Hubungkan ke perangkat tanaman pintar Anda untuk menggunakan kontrol manual

source: Plant Status
id: Status Tanaman

source: Needs Water
id: Perlu Air

source: Moderate
id: Sedang

source: Well Watered
id: Sudah Disiram

source: Cold
id: Dingin

source: Cool
id: Sejuk

source: Warm
id: Hangat

source: Hot
id: Panas

source: Manual Watering
id: Penyiraman Manual

source: Duration
id: Durasi

source: Quick Select
id: Pilih Cepat

source: Start Watering
id: Mulai Menyiram

source: Stop Watering
id: Hentikan Penyiraman

# connectToEnableControl
source: Connect to device to enable manual control
id: Hubungkan ke perangkat untuk mengaktifkan kontrol manual

source: Emergency Controls
id: Kontrol Darurat

source: Emergency Stop
id: Henti Darurat

# immediatelyStopWatering
source: Immediately stop all watering
id: Segera hentikan semua penyiraman

source: STOP
id: HENTI

# wateringStartedFor
source: Watering started for {duration}
id: Penyiraman dimulai selama {duration}

# failedToStartWatering
source: Failed to start watering: {error}
id: Gagal memulai penyiraman: {error}

source: Watering stopped
id: Penyiraman dihentikan

# failedToStopWatering
source: Failed to stop watering: {error}
id: Gagal menghentikan penyiraman: {error}

# emergencyStopAll
source: EMERGENCY STOP - All watering stopped
id: HENTI DARURAT - Semua penyiraman dihentikan

# emergencyStopFailed
source: Emergency stop failed: {error}
id: Henti darurat gagal: {error}

source: Watering Schedule
id: Jadwal Penyiraman

# connectToManageSchedules
source: Connect to your device to manage watering schedules
id: Hubungkan ke perangkat Anda untuk mengelola jadwal penyiraman

source: No Schedules Yet
id: Belum Ada Jadwal

# addFirstSchedule
source: Add your first watering schedule to keep your plant healthy automatically
id: Tambahkan jadwal penyiraman pertama Anda untuk menjaga tanaman tetap sehat secara otomatis

source: Add Schedule
id: Tambah Jadwal

source: Schedule {slot}
id: Jadwal {slot}

# nextScheduled
source: Next: {time}
id: Berikutnya: {time}

source: Delete
id: Hapus

source: Delete Schedule
id: Hapus Jadwal

# deleteScheduleConfirm
source: Are you sure you want to delete Schedule {slot}?
id: Apakah Anda yakin ingin menghapus Jadwal {slot}?

source: Cancel
id: Batal

source: New Schedule
id: Jadwal Baru

source: Edit Schedule
id: Edit Jadwal

source: Watering Time
id: Waktu Penyiraman

source: Enable Schedule
id: Aktifkan Jadwal

source: Save
id: Simpan

# failedToLoadSchedules
source: Failed to load schedules: {error}
id: Gagal memuat jadwal: {error}

source: Schedule saved successfully
id: Jadwal berhasil disimpan

# failedToSaveSchedule
source: Failed to save schedule: {error}
id: Gagal menyimpan jadwal: {error}

source: Data Logs
id: Log Data

source: Charts
id: Grafik

source: History
id: Riwayat

source: No Chart Data
id: Tidak Ada Data Grafik

# connectForCharts
source: Connect to your device and wait for sensor data to view charts
id: Hubungkan ke perangkat Anda dan tunggu data sensor untuk melihat grafik

source: No Log Data
id: Tidak Ada Data Log

# tapDownloadLogs
source: Tap the download button to fetch log data from your device
id: Ketuk tombol unduh untuk mengambil data log dari perangkat Anda

source: Download Logs
id: Unduh Log

# connectToDownloadLogs
source: Connect to device to download log data
id: Hubungkan ke perangkat untuk mengunduh data log

source: Time Range
id: Rentang Waktu

# hours24
source: 24 Hours
id: 24 Jam

# days7
source: 7 Days
id: 7 Hari

# days30
source: 30 Days
id: 30 Hari

# logDataRequested
source: Log data requested successfully
id: Data log berhasil diminta

# failedToRequestLogs
source: Failed to request logs: {error}
id: Gagal meminta log: {error}

source: Device
id: Perangkat

source: Not connected
id: Tidak terhubung

source: Connect
id: Hubungkan

source: Sync Device Time
id: Sinkronkan Waktu Perangkat

# updateDeviceRTC
source: Update device RTC with current time
id: Perbarui RTC perangkat dengan waktu saat ini

source: Data Management
id: Pengelolaan Data

source: Clear Local Data
id: Hapus Data Lokal

# removeStoredReadings
source: Remove all stored sensor readings ({count} entries)
id: Hapus semua pembacaan sensor tersimpan ({count} entri)

source: Download Device Logs
id: Unduh Log Perangkat

# fetchHistoricalData
source: Fetch historical data from device
id: Ambil data historis dari perangkat

source: About
id: Tentang

# version
source: Version 1.0.0
id: Versi 1.0.0

source: Device Info
id: Info Perangkat

# esp32System
source: ESP32 Smart Plant Monitoring System
id: Sistem Monitor Tanaman Pintar ESP32

source: Made with Flutter
id: Dibuat dengan Flutter

# builtForPlantCare
source: Built for plant care enthusiasts
id: Dibuat untuk pecinta perawatan tanaman

source: Current Status
id: Status Saat Ini

# deviceTimeSynced
source: Device time synchronized successfully
id: Waktu perangkat berhasil disinkronkan

# failedToSyncTime
source: Failed to sync time: {error}
id: Gagal menyinkronkan waktu: {error}

# clearLocalDataConfirm
source: This will remove all stored sensor readings from your device. This action cannot be undone. Are you sure you want to continue?
id: Ini akan menghapus semua pembacaan sensor yang tersimpan dari perangkat Anda. Tindakan ini tidak dapat dibatalkan. Apakah Anda yakin ingin melanjutkan?

source: Clear Data
id: Hapus Data

# localDataCleared
source: Local data cleared successfully
id: Data lokal berhasil dihapus

# logDownloadRequested
source: Log download requested. Check the Logs tab.
id: Unduhan log diminta. Periksa tab Log.

source: Good
id: Bagus

source: Low
id: Rendah

source: Scan
id: Pindai

# tapScanToFind
source: Tap scan to find your smart plant device
id: Ketuk pindai untuk menemukan perangkat tanaman pintar Anda

# devicesFound
source: {count} device(s) found
id: {count} perangkat ditemukan

# lookingForDevices
source: Looking for smart plant devices...
id: Mencari perangkat tanaman pintar...

source: Establishing connection...
id: Membuat koneksi...

source: Unknown device
id: Perangkat tidak dikenal

source: Quick Actions
id: Aksi Cepat

source: Water Now
id: Siram Sekarang

# seconds30
source: 30 seconds
id: 30 detik

source: Sync Time
id: Sinkron Waktu

source: Update RTC
id: Perbarui RTC

source: Refresh Data
id: Segarkan Data

source: Get latest
id: Dapatkan terbaru

source: View Logs
id: Lihat Log

source: Data history
id: Riwayat data

# connectToUseQuickActions
source: Connect to your smart plant to use quick actions
id: Hubungkan ke tanaman pintar Anda untuk menggunakan aksi cepat

source: Water Plant
id: Siram Tanaman

source: Select watering duration:
id: Pilih durasi penyiraman:

# durationSeconds
source: Duration: {duration} seconds
id: Durasi: {duration} detik

source: Time synchronized successfully
id: Waktu berhasil disinkronkan

source: Data refresh requested
id: Penyegaran data diminta

# logDataRequestedShort
source: Log data requested
id: Data log diminta
